import { Box, Modal, Typography } from "@mui/material";

const style = {
    position: "absolute",
    top: "50%",
    left: "50%",
    transform: "translate(-50%, -50%)",
};

const Regulations = ({ open, close }) => {
    return (
        <Modal open={open} onClose={close}>
            <Box
                style={style}
                sx={{
                    direction: "rtl",
                    maxHeight: "460px",
                    padding: "4px 8px",
                    overflow: "auto",
                    scrollBehavior: "smooth",
                    borderRadius: "8px",
                    background: "#f3f8ff",
                    position: "relative",
                    margin: "0 auto",

                }}
            >
                <Typography
                    sx={{ color: "#9ea9ba", margin: "6px 0" }}
                    variant="subtitle2"
                >
                    תקנון סוויצ'אט
                </Typography>
                <Typography
                    sx={{ color: "#9ea9ba", margin: "6px 0" }}
                    variant="subtitle1"
                >
                    כללי
                </Typography>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    1. ברוכים הבאים לאתר switchat שכתובתו ברשת האינטרנט: www.switchats.com
                    (להלן: "האתר" ו/או "סוויצ'אט"), המופעל ע"י חברת סוויצאטס בע"מ (להלן:
                    "החברה").
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    2. האתר הוקם כדי לאפשר פלטפורמה חברתית לשיח בין זרים באמצעות הצ'אט
                    (להלן: "הצ'אט").
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    3. המידע ו/או השימוש באתר כפופים לתנאים, ההגבלות והאחריות כמפורט להלן.
                    ידוע למשתמש באתר כי החברה רשאית לשנות מעת לעת את תנאי התקנון והשירותים
                    המוצעים באתר על תנאיהם והיקפם.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    4. בכל מקום בו ההפניה הינה בלשון זכר הכוונה היא לגברים ונשים כאחד,
                    הדבר נעשה מטעמי נוחות בלבד. קבלת תנאי השימוש
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    5. המשתמש באתר מאשר כי קרא את תקנון האתר, ומקבל על עצמו את התנאים
                    המפורטים בתקנון זה, לעיל ולהלן.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    6. התנאים המפורטים להלן חלים בנוסף לתנאים המפורטים באתר עצמו, בכל מקרה
                    של סתירה בין האמור באתר לבין התקנון, יגברו הוראות התקנון, כמפורט לעיל
                    ולהלן.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    7. בכל מקרה של סתירה בין הוראות התקנון זה לבין האמור בכל דרך פרסומית
                    אחרת, בין על ידי החברה ובין על ידי המפרסמים באתר, בדבר השירותים
                    המפורסמים באתר, יגברו הוראות תקנון.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    8. המידע המופיע באתר מתעדכן מעת לעת ועל-כן אין להסתמך על מידע ישן ו/או
                    מידע שאינו עדכני לחלוטין, ובמקרה של ספק או סתירה יש ליצור קשר ישיר עם
                    החברה, עפ"י דרכי ההתקשרות המפורטים להלן. כללי התנהגות והשימוש בצ'אט
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    9. אתר סוויצ'אט קם במטרה להוות זירת שיח ברשת האינטרנט ולחבר בין
                    משתמשיו באמצעות הצ'אט, בהתאם לכך המשתמש מתחייב שלא להפר את תנאי
                    ההתנהגות להלן:
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    10. השימוש באתר כפוף להוראות כל דין ולתנאי השימוש לעיל ולהלן.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    11. חל איסור לפרסם באתר מסרים המכילים מפגעי מחשב לרבות רוגלות
                    ("וירוסים") מכל סוג שהוא.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    12. חל איסור לפרסם או לשדר דרך באתר חומר אשר מפר בכל דרך שהיא זכויותיו
                    של צד ג' או כל חומר לא-חוקי או בניגוד לדין, מאיים, פוגעני, מטעה,
                    מעליב, משמיץ, דוחה, חודר/מפר פרטיות, וולגרי, גס, מגונה או באופן אחר
                    מעורר התנגדות, מעודד התנהגות פלילית, מקים עוולה אזרחית ו/או שמפר בדרך
                    אחרת כל חוק ו/או דין ו/או אשר מכיל דבר פרסום או שידול.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    13. חל איסור על המשתמש לפרסם או לשדר חומר מסחרי ו/או פרסומי, מבלי
                    שיקבל לרשותו אישור מפורש ובכתב מהחברה.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    14. חל איסור לפעול באתר באופן שמפריע או מונע ממשתמש אחר לעשות שימוש
                    באתר.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    15. חל איסור לפרסם או לשדר בכל דרך אחרת בצ'אט פרטים מזהים ו/או פרטים
                    אישיים אחרים של המשתמש עצמו או של אחר, לרבות כתובות, מספרי טלפון ומידע
                    מזהה כיוצא בזה.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    16. החברה מעודדת את משתמשי האתר להתייחס בזהירות ובביקוריתיות לתכנים
                    שמפרסמים משתמשי האתר בצ'אט. תכנים אלה אינם מתפרסמים מטעמה של החברה,
                    ולפיכך היא אינה תהיה אחראית למהימנותם, אמינותם, דיוקם או שלמותם,
                    והחברה אינה אחראית לכל לכל תוצאה שתיגרם מהשימוש בהם או מההסתמכות
                    עליהן.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    17. החברה שומרת לעצמה את הזכות להסיר מסרים אשר פרסומם ו/או שידורם מפר
                    את הוראות התקנון, זאת גם ללא הודעה מוקדמת כלשהי או הודעה כלל.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    18. הפרה של הכללים לעיל תאפשר לחברה לחסום את המשתמש מלגלוש באתר לאלתר
                    וללא הודעה מוקדמת על פי שיקול דעתה של החברה, לרבות מיצוי זכויות
                    משפטיות של החברה כלפי המשתמש. התחייבות המשתמש
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    19. הגלישה באתר והשימוש בצ'אט ו/או הפרטים המופיעים בו, לרבות פרסומים
                    הינם באחריות המשתמש באתר.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    20. המשתמש מצהיר כי ידוע שהשירותים הניתנים באתר ניתנים לשימוש כמות
                    שהם, ולא תהיה לו כל טענה, תביעה או דרישה כלפי החברה בגין אופיים של
                    השירותים שמציע האתר, או בגין פרסום פרטים או מידע מטעם משתמש אחר באתר.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    21. המשתמש מתחייב שלא להפר את תנאי כללי התנהגות והשימוש בצ'אט כפי שהם
                    מופיעים לעיל.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    22. המשתמש מצהיר כי ידוע לו שחלה עליו האחריות המלאה לכל נזק שיגרם,
                    ישיר או עקיף, כתוצאה מהודעה שפורסמו על ידו, ללא יוצא מן הכלל. השימוש
                    באתר מהווה הסכמה ברורה לכך שידוע לך, כי ככותב ההודעה בצ'אט, הנך האחראי
                    היחיד והישיר על תוכנה של ועל התוצאות הנובעות ממנה.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    23. המשתמש מצהיר כי ידוע לו שהחברה לא תישא באחריות לפעילות בלתי חוקית
                    שנעשתה על ידי משתמשי האתר או כל גורם אחר שאינו בשליטתה המלאה.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    24. החברה לא תשא באחריות לנזק שנגרם למשתמש או לצד ג', כתוצאה ישירה או
                    עקיפה, של שימוש באתר, לרבות נזק שנגרם במהלך ו/או כתוצאה מהשימוש בצ'אט
                    והאינטרקציה עם משתמשים אחרים. המשתמש ישא באחריות באופן בלעדי, ופוטר
                    מראש את החברה באחריותה בעניין.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    25. המשתמש מצהיר כי מתחייב שלא לפגוע בכבודם, פרטיותם של משתמשים אחרים
                    בצ'אט, לרבות אי מסירת פרטים אישיים ו/או מזהים של משתמש אחר.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    26. המשתמש מצהיר כי ידוע לו והוא נותן הסכמתו לכך שישא בשיפוי החברה
                    בגין כל דרישה ו/או תביעה של צד שלישי, לרבות שכ"ט עו"ד, שנובעת משימושו
                    באתר, הפרת תנאי התקנון או זכות אחרת של אדם או תאגיד, על ידו או על ידי
                    משתמש אחר הפועל באמצעות מחשבו.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    27. המשתמש מצהיר כי ידוע לו כי קיימת אפשרות בעתיד כי , האתר לא יהיה
                    זמין באופן זמני או לאורך זמן, בשל צרכי תחזוקה ו/או צרכים נוספים
                    שעשויים להשתנות מעת לעת. קניין רוחני
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    28. מובהר כי זכויות בקניין הרוחני של אתר זה שייכות לחברה בהתאם לדיני
                    זכויות יוצרים התקפים בישראל ועל פי אמנות בינלאומיות.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    29. זכויות היוצרים מתייחסות לטקסט, תמונה, איור, קטעי קול, קטעי וידאו,
                    מוסיקה, יישומי תוכנה וגרפיקה, דמויות ומוצרים המוצעים למכירה לציבור
                    הרחב (להלן: "החומר המוגן").
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    30. חל איסור על המשתמש לעשות שימוש מסחרי בחומר המוגן, ובכלל זה אסור
                    להעתיק, להפיץ מחדש, לשדר או לפרסם חומר מוגן ללא הסכמה ובכתב מאת החברה.
                    המשתמש באתר משחרר בזאת את החברה מאחריות, מכל סוג שהוא, לטיב ו/או
                    לאיכות ו/או להתאמת השירות ו/או ההטבה ו/או מימושם בפועל לצרכיו האישיים.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    31. סימני המסחר ומודעות המפרסמים באתר הינם קניינם של המפרסמים בלבד, על
                    כן חל איסור לעשות בהם שימוש בלא הסכמת המפרסם בכתב ומראש. מדיניות
                    פרטיות
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    32. אין המשתמש חייב למסור פרטים כלשהם, אולם יצוין, כי ישנן מקום והאתר
                    מבקש מסירת פרטים: שם מלא, כתובת דואר אלקטרוני ומספר טלפון נייד, אי
                    מסירת פרטים אלה עלולה להוות מניעה לשימוש באתר, זאת בהתאם לשיקול הדעת
                    של החברה ולמדיניותה כפי שמתעדכנת מעת לעת.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    33. היות והאתר נמצא בסביבה מקוונת שבה אין אפשרות לאבטחה מוחלטת, משתמש
                    המוסר פרטים באתר זה עושה זאת על אחריותו בלבד.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    34. אתר האינטרנט ו/או החברה ו/או המועדון לא יישאו באחריות לכל נזק ישיר
                    או עקיף, לאבדן הכנסות, להוצאות, לפגיעה בשם טוב, להסתמכות, להפרת חוזה
                    שנגרמו, אם וככל שנגרמו, בשל פגיעה בסודיות פרטי המשתמשים, דליפת פרטי
                    אמצעי תשלום ו/או פרטי ספקים, המשתמש ו/או המפרסם מצהירים כי הם מוותרים
                    על כל טענה בנושא וכי לחברה אין אחריות בנושא.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    35. המשתמש מצהיר כי ידוע לו שביצוע שימוש באתר, מהווה הסכמה של המשתמש
                    לקבל דואר אלקטרוני ו/או מסרונים (SMS) מהחברה, לרבות דואר אלקטרוני ו/או
                    מסרונים (SMS) שמטרתם לעודד רכישת מוצר או שירות, אשר עשוי לכלול עדכונים
                    בנושאים שונים, פרטים על ביצוע עסקה, פרסום וכיוצ"ב, ולרבות מסרים
                    המכילים תוכן העונה על ההגדרה "דבר פרסומת", על פי תיקון 40 לחוק התקשורת
                    (בזק ושידורים), התשמ"ב-1982. המשתמש רשאי, בכל עת, להודיע לחברה המפעילה
                    את אתר האינטרנט על רצונו להסיר את פרטיו מרשימות הדיוור של החברה, ע"י
                    פנייה בכתב לחברה.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    36. בנוסף, החברה תהיה רשאית להשתמש במידע אישי של משתמש שנאסף אגב שימוש
                    באתר לצרכים פנימיים, כגון ניתוח מידע מצרפי בדבר דפוסי רכישה והתנהגות
                    של משתמשים ו/או ספקים, ולצרכי תחקור תלונות ו/או ביקורות, לרבות באמצעות
                    "עוגיות" (cookies) כל משתמש יכול להגדיר מחדש את הדפדפן שלו כך שיסרב
                    לכל ה-cookies או שיתריע על cookies שנשלחים אליו. למרות זאת, יש לשים לב
                    שמספר חלקים של האתר עלולים לא לתפקד כראוי אם משתמש מסרב לקבל cookies.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    37. משתמש שיגיש תלונה באמצעות פנייה לחברה כאמור, יחשב כמי שאישר להעביר
                    את פרטיו לצורך בירור תלונתו. יודגש, כי אין באמור משום התחייבות של
                    החברה לטפל בתלונות.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    38. ידוע למשתמש כי החברה המפעילה את האתר יענו לכל בקשה למסירת מידע –
                    כולל מידע אישי ומידע פרטי – אם תוגש בהתאם להליך חוקי, כגון צו חיפוש,
                    צו בית-משפט וכדומה.
                </span>

                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    39. קישורים ומפרסמים
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    40. האתר כולל תכנים מסחריים, כגון פרסומות ומודעות, הנמסרים לפרסום
                    מטעמם של מפרדמים שונים. תכנים אלה יכולים להיות בטקסט בתמונה או בקול
                    (להלן: "תכנים מסחריים" או "פרסומים").
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    41. החברה לא תישא באחריות לתכנים מסחריים, שיפורסמו באתר. החברה אינה
                    בודקת, כותבת, מוודאת או עורכת את תוכן הפרסומים האלה או את אמינותם.
                    האחריות הבלעדית לתכנים המסחררים המפורסמים ולכל תוצאה שתגרם משימוש בהם
                    או הסתמכות עליהם חלה על המפרסמים.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    42. כל עסקה שתיעשה בעקבות תכנים מסחריים שפורסמו באתר תסוכם ישירות בין
                    המשתמש לבין המפרסם. החברה איה צד לעסקה ולא תישא באחריות לשרותים
                    ולטובין שפורסמו.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    43. אין בהסכמת החברה לפרסם תכנים מסחריים של מפרסם באתר כדי להתחייב על
                    כמות החשיפה כתוצאה מהפרסום.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    44. באתר זה יתכנו קישורים (links) לאתרים אחרים. אין בהוראות שלעיל
                    ולהלן כדי לגרוע מהוראות תנאי השימוש באתרים אחרים ואין בהוראות האתרים
                    האחרים משום ביטול ו/או החרגת הוראות תקנון זה.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    45. על המשתמש באתר זה לדאוג לבחון ולקרוא את הוראות האתרים האחרים
                    שבאמצעות קישורים באתר זה ניתן להגיע אליהם.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    46. הקישורים נועדו לנוחות המשתמש בלבד. לעניין קישורים לאתרים חיצוניים,
                    שאינם שייכים לחברה, אם לא צוין אחרת באתר זה, ידוע למשתמש כי אין בין
                    האתר החיצוני המקושר לבין החברה כל יחסים משפטיים או מסחריים ואין לחברה
                    כל שליטה או זכות בחומר הנמצא באתרים אלה.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    47. אין החברה אחראית לתוכן החומר הנמצא באתרי צד שלישי או לתקינות
                    ולתוכן הקישורים, ואין לפרש קישורים לאתרי צד שלישי כמתן אישור, המלצה או
                    העדפה, ע"י החברה, לאותם אתרים מקושרים, לרבות מסמכים וכל חומר אחר
                    הנמצאים בהם, למפעילי האתרים או למוצרים המוצגים בהם. שונות
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    48. הדין החל על הפעולות באתר ועל תנאי שימוש אלה, הוא הדין הישראלי
                    בלבד. סמכות ייחודית ובלעדית לדון בכל תביעה ו/או בקשה העשויה להיות
                    מוגשת בקשר לתקנון זה נתונה לבית משפט בתל- אביב המוסמך לפי העניין.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    49. חוסר התקפות של אחד או יותר מתנאי תקנון זה לא תשפיע על תקפות חוזה
                    זה בכללותו. תנאי שאינו תקף או שלא ניתן לאוכפו יוחלף בתנאי תקף אשר יהיה
                    קרוב ביותר לתנאי המקורי שאותו הוא מחליף, עד כמה שניתן על פי החוק.
                </span>
                <span
                    style={{
                        margin: "4px 0",
                        fontSize: ".89rem",
                        color: "#9ea9ba",
                        display: "block",
                    }}
                >
                    50. פרטי יצירת קשר: קריאת תקנון זה, מהווה תנאי בסיסי לשימוש באתר.
                    משתמש העושה שימוש באתר, מאשר בזאת כי קרא את התקנון, כי הוראותיו מובנים
                    מובנות לו וכי הוא מקבל את התנאים המופיעים בו ללא כל סייג.
                </span>
                <button
                    style={{
                        padding: "8px",
                        cursor: "pointer",
                        width: "100%",
                        position: "sticky",
                        bottom: "-5px",
                        outline: "none",
                        background: "linear-gradient(90deg,#ed568e 0,#746bc5 50%,#1d7aee)",
                        borderBottomRightRadius: "8px",
                        borderBottomLeftRadius: "8px",
                        appearance: "none",
                        border: "0",
                    }}
                ></button>
            </Box>
        </Modal>
    );
};

export default Regulations;
